Revit 2027 API
SchedulableField.GetName Method
 Gets the name of the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetName(
	Document document
)
Public Function GetName (
	document As Document
) As String
public:
String^ GetName(
	Document^ document
)
member GetName :
        document : Document -> string
Parameters
document Document
 The document in which the field will be used.
Return Value
String
 The name of the field.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The parameter doesn't exist in document.
See Also
Reference
SchedulableField Class
Autodesk.Revit.DB Namespace